In [98]:
import numpy as np
import pandas as pd
import sys
from numpy.random import randn

In [14]:
ser1=pd.Series(data=[1,2,3,4], index=['a','b','c','d'])

In [15]:
ser1['a']

1

In [27]:
ser2=pd.Series(data={'mohit':1009,'mukesh':1008,'k':30,'ab':90})

In [28]:
ser2

ab          90
k           30
mohit     1009
mukesh    1008
dtype: int64

In [29]:
ser3=pd.Series(data={'mohit':1019,'mukesh':1005,'v':50})

In [30]:
ser2 + ser3

ab           NaN
k            NaN
mohit     2028.0
mukesh    2013.0
v            NaN
dtype: float64

In [33]:
data = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['X','Y','Z','E'])

In [34]:
data

          X         Y         Z         E
A  1.171052 -1.207345  1.198273 -1.296511
B -2.200257 -1.226925  0.316483 -1.331363
C -0.677262 -0.307083 -2.183037  0.465064
D -1.457602  0.410099  0.199054  0.082864
E  0.308474 -0.772248 -0.754057 -0.554929

In [36]:
data['A','X']=500

In [37]:
data

          X         Y         Z         E  (A, X)
A  1.171052 -1.207345  1.198273 -1.296511     500
B -2.200257 -1.226925  0.316483 -1.331363     500
C -0.677262 -0.307083 -2.183037  0.465064     500
D -1.457602  0.410099  0.199054  0.082864     500
E  0.308474 -0.772248 -0.754057 -0.554929     500

In [41]:
data['A','X']

A    500
B    500
C    500
D    500
E    500
Name: (A, X), dtype: int64

In [47]:
data.drop(('A','X'), axis=1,inplace=True)

In [48]:
data

          X         Y         Z         E
A  1.171052 -1.207345  1.198273 -1.296511
B -2.200257 -1.226925  0.316483 -1.331363
C -0.677262 -0.307083 -2.183037  0.465064
D -1.457602  0.410099  0.199054  0.082864
E  0.308474 -0.772248 -0.754057 -0.554929

In [49]:
data.loc['A','X']

1.1710523943508753

In [50]:
# subset of data frame
data.loc[['A','B'],['X','Z']]

          X         Z
A  1.171052  1.198273
B -2.200257  0.316483

In [53]:
bool_data = data > 0

In [54]:
bool_data

       X      Y      Z      E
A   True  False   True  False
B  False  False   True  False
C  False  False  False   True
D  False   True   True   True
E   True  False  False  False

In [55]:
data[bool_data]

          X         Y         Z         E
A  1.171052       NaN  1.198273       NaN
B       NaN       NaN  0.316483       NaN
C       NaN       NaN       NaN  0.465064
D       NaN  0.410099  0.199054  0.082864
E  0.308474       NaN       NaN       NaN

In [58]:
# conditional selection
data[data['X']>0][['Y','E']]

          Y         E
A -1.207345 -1.296511
E -0.772248 -0.554929

In [64]:
data[(data['X']>0) | (data['E']>0)]

          X         Y         Z         E
A  1.171052 -1.207345  1.198273 -1.296511
C -0.677262 -0.307083 -2.183037  0.465064
D -1.457602  0.410099  0.199054  0.082864
E  0.308474 -0.772248 -0.754057 -0.554929

In [67]:
data[(data['X']>0) & (data['Z']>0)]

          X         Y         Z         E
A  1.171052 -1.207345  1.198273 -1.296511

In [76]:
outside=['G1','G1','G2','G2','a','b','c']
inside=[1,2,1,2,4,9,10]
h_index=list(zip(outside,inside))
h_index

[('G1', 1), ('G1', 2), ('G2', 1), ('G2', 2), ('a', 4), ('b', 9), ('c', 10)]

In [77]:
type(h_index[0])

tuple

In [78]:
multi_Index=pd.MultiIndex.from_tuples(h_index)

In [79]:
multi_Index

MultiIndex(levels=[['G1', 'G2', 'a', 'b', 'c'], [1, 2, 4, 9, 10]],
           labels=[[0, 0, 1, 1, 2, 3, 4], [0, 1, 0, 1, 2, 3, 4]])

In [82]:
df=pd.DataFrame(randn(7,2),multi_Index,['A','B'])

In [83]:
df

              A         B
G1 1   1.772577 -0.148105
   2  -0.390651 -2.028577
G2 1   1.935500 -0.449014
   2   0.991028 -0.773880
a  4  -0.418346  1.299491
b  9  -0.782418  0.006665
c  10  1.583122  0.290676

df.loc['G1'].loc[1,'A']

In [87]:
df.loc['G1'].loc[1,'A']

1.7725772537380264

In [89]:
d={'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}

In [90]:
d

{'A': [1, 2, nan], 'B': [1, nan, nan], 'C': [1, 2, 3]}

In [91]:
daf=pd.DataFrame(d)

In [92]:
daf

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [93]:
daf.dropna()

     A    B  C
0  1.0  1.0  1

In [95]:
# thresh 2 means the row should have 2 not null values
daf.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [106]:
minint=-sys.maxsize-1

In [107]:
daf.fillna(value=minint)

              A             B  C
0  1.000000e+00  1.000000e+00  1
1  2.000000e+00 -9.223372e+18  2
2 -9.223372e+18 -9.223372e+18  3

In [108]:
# pandas groupby
comp_data={'Company':['Google','Google','Microsoft','Microsoft','Facebook'],
           'Employee':['M','K','Mohit','Dhingra','D'],
           'Salary':[1000,2000,5000,9000,9900]}

In [110]:
comp_df=pd.DataFrame(comp_data)

In [111]:
comp_df

     Company Employee  Salary
0     Google        M    1000
1     Google        K    2000
2  Microsoft    Mohit    5000
3  Microsoft  Dhingra    9000
4   Facebook        D    9900

In [122]:
comp_sal=comp_df.groupby('Company')
comp_sal_group=comp_sal.sum()
comp_sal_group

           Salary
Company
Facebook     9900
Google       3000
Microsoft   14000

In [127]:
comp_df.groupby('Company').describe()

          Salary
           count    mean          std     min     25%     50%     75%     max
Company
Facebook     1.0  9900.0          NaN  9900.0  9900.0  9900.0  9900.0  9900.0
Google       2.0  1500.0   707.106781  1000.0  1250.0  1500.0  1750.0  2000.0
Microsoft    2.0  7000.0  2828.427125  5000.0  6000.0  7000.0  8000.0  9000.0

In [129]:
# merging
left=pd.DataFrame({'A':[1,2],'B':[3,4],'key':[0,1]})
right=pd.DataFrame({'C':[7,8],'D':[3,4],'key':[0,1]})
pd_merge=pd.merge(left,right,how='inner',on='key')

In [130]:
pd_merge

   A  B  key  C  D
0  1  3    0  7  3
1  2  4    1  8  4

In [135]:
left=pd.DataFrame({'A':[1,2],'H':[3,4],'key':[0,1]})
right=pd.DataFrame({'C':[7,8],'H':[3,5],'key':[0,1]})
pd_merge=pd.merge(left,right,how='inner',on='key')

In [136]:
pd_merge

   A  H_x  key  C  H_y
0  1    3    0  7    3
1  2    4    1  8    5

In [137]:
left

   A  H  key
0  1  3    0
1  2  4    1

In [145]:
left['A'].apply(lambda x: x*2)

0    2
1    4
Name: A, dtype: int64